In [33]:
import pandas as pd

df_one = pd.DataFrame({
    'k1'  :['A', 'A', 'B', 'B', 'C', 'C'],
    'col1':[100, 200, 300, 300, 400, 500],
    'col2':['NY', 'CA', 'WA', 'WA', 'AK', 'NV']
})

In [34]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [35]:
 df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [36]:
df_one['col2'].nunique()

5

In [37]:
df_one['col2'].value_counts()

WA    2
NV    1
NY    1
CA    1
AK    1
Name: col2, dtype: int64

In [38]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [39]:
df_one['NEW'] = df_one['col1'] * 10

In [40]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [41]:
def grab_second_letter(state):
    return state[0]

In [42]:
grab_second_letter('MY')

'M'

In [43]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [44]:
df_one['first letter'] = df_one['col2'].apply(grab_second_letter)

In [45]:
df_one

  k1  col1 col2   NEW first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [46]:
def complex_letter(state):

    if state[0] == 'W':
        return "New York"
    else:
        return "Washinton"

In [47]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [48]:
my_map = {'A': 1, 'B': 2, 'C': 3}

In [49]:
df_one['num'] = df_one['k1'].map(my_map)

In [50]:
df_one

  k1  col1 col2   NEW first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [54]:
df_one['col1'].max()

500

In [55]:
df_one['col1'].idxmax()

5

In [56]:
df_one.columns

Index(['k1', 'col1', 'col2', 'NEW', 'first letter', 'num'], dtype='object')

In [58]:
df_one.columns = ['c1', 'c2', 'c3', 'c4', 'c5', 'c6']

In [62]:
df_one.sort_values('c3', ascending=False)

  c1   c2  c3    c4 c5  c6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

In [70]:
predictions = pd.DataFrame({'pred': [0, 1, 1, 0, 1]})
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [74]:
features = pd.DataFrame({
    'A': [100, 200, 300, 400, 500],
    'B': [12, 13, 14, 15, 16]
})
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [77]:
pd.concat([
    features,
    predictions,
], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [78]:
df_one['c1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: c1, dtype: object

In [79]:
pd.get_dummies(df_one['c1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1